import { useRouter,createRef,useRef } from 'next/router'
import { Card, Divider, } from 'antd';
import dynamic from 'next/dynamic'
import { useEffect, useState } from 'react';


const { Meta } = Card;
const CustImage = dynamic(() => import("/components/cusImage.js"))
const ContentHeader = dynamic(() => import("/components/ncds/contentheader"))
const Topic = dynamic(() => import("/components/ncds/topic.js"),
{ ssr: false })
const Content = dynamic(() => import("/components/ncds/content.js"),
{ ssr: false })
const DisplayFoodReadMore = dynamic(() => import("/components/displayFoodReadMore.js"),
{ ssr: false })
const DisplayBlogReadMore = dynamic(() => import("/components/displayBlogReadMore"),
{ ssr: false })

export default function Index() {
    const [NCDS,setNCDS] = useState()
    const router = useRouter()
    const { categories, ncds } = router.query
    useEffect(()=>{
        if(ncds && !NCDS){
            (async()=>{
                const dataNCDS = await fetch(`/api/getNCDS?id=${ncds}`).then(res=>res.ok?res.json():notification.error({message:"Error",description:"ไม่พบข้อมูล"}))
                setNCDS(dataNCDS)
            })()
        }
    },[NCDS, ncds])

    return (
        <>
            {NCDS ?
                <div className="flex flex-col w-full h-auto min-h-screen gap-4 my-auto">
                    
                    <div className="flex flex-col bg-gray-50 ipad:flex-row gap-y-1">
                        <Content className="w-full " bodyContent={bodyContent} />
                    </div>
                    <div className='mx-10'>
                    <Topic raw={data} categories={categories} placeholder={"ชื่อโรค , อาการ , สาเหตุ "} />
                    {/* <DisplayFoodReadMore data={blogTrends} title={`อาหาร`}  /> */}
                    <DisplayBlogReadMore data={blogTrends} title={`บทความยอดนิยม`} />
                    </div>
                    
                    {/* <Ncds ncds={ncds} /> */}
                </div>
                : categories ?
                    <div className="flex flex-col justify-center w-full h-full min-h-screen gap-4 mx-auto">
                        <div className="text-center p-5 ">
                            <CustImage src={"https://thaipedendo.org/wp-content/uploads/2020/08/Type-2-diabetes-crop-scaled.jpg"} alt={"0"} className="mr-auto ml-auto w-50 block" width="786px" height="288px" preview={false} />
                            <p className='w-2/3 text-left ml-auto mr-auto'>โรคที่ร่างกายมีระดับน้ำตาลในเลือดสูงผิดปกติ โดยเกิดจากความผิดปกติของการใช้น้ำตาลทำให้ร่างกายไม่สามารถนำน้ำตาลไปใช้เป็นพลังงานได้ตามปกติ ทำให้มีระดับน้ำตาลสูงขึ้น</p>
                            <div className='border-green-800 border-b-2 border-solid w-8/12 mx-auto' ></div>
                        </div>
                        <ContentHeader headerData={headerData} url_yt={"https://www.youtube.com/embed/elkz5u4QvXQ"}/>
                        
                        <div className='lg:mx-32 mx-0'>
                            <Topic raw={data} categories={categories} placeholder={"ชื่อโรค , อาการ , สาเหตุ "} />
                            <DisplayFoodReadMore data={blogTrends} title={`บทความยอดนิยม`}  />
                        </div>
                    </div> : <></>
            }
        </>
    )
}

const data = {
    title_th: "อาหารที่เกี่ยวข้อง", title_en: "soup",
    data: [
        { title: "ต้มยำกุ้ง", detail: "343", imgUrl: "https://static.naewna.com/uploads/news/source/561099.jpg" },
        { title: "ต้มยำไก่", detail: "395.4", imgUrl: "https://blog.samanthasmommy.com/wp-content/uploads/2019/01/klang-food-23161-8-2.jpg" },
        { title: "ต้มยำปลาทู", detail: "446.5", imgUrl: "https://img-global.cpcdn.com/recipes/d79ae43ed37668f0/1200x630cq70/photo.jpg" },
        // { title: "ต้มยำทะเล", detail: "365", imgUrl: "https://i.ytimg.com/vi/gjm1toMrY8g/maxresdefault.jpg" },
        // { title: "ต้มยำปลานิล", detail: "290", imgUrl: "https://i.ytimg.com/vi/idhojWWMYd0/maxresdefault.jpg" },
        // { title: "ต้มยำปลาแซลมอน", detail: "350", imgUrl: "https://i.pinimg.com/originals/b5/a1/fc/b5a1fc124918bf6edfdf17b90db4abfb.jpg" },
    ]
}
const bodyContent = [
    {
        title: "",
        imgUrl : "https://siph-space.sgp1.digitaloceanspaces.com/media/upload/bread-2864703_640.jpg",
        content: "อาหารสำหรับผู้ป่วยเบาหวานคืออาหารทั่วไปไม่แตกต่างจากอาหารที่รับประทานเป็นปกติ แต่ควรเป็นอาหารที่ไม่หวานจัด โดยคำนึงถึงปริมาณ ชนิดของแป้ง และไขมันเป็นสิ่งสำคัญ เพื่อควบคุมระดับน้ำตาลและไขมันในเลือด รวมถึงการรักษาน้ำหนักตัวให้อยู่ในเกณฑ์ปกติ นอกจากนี้ ควรรับประทานอาหารให้เป็นเวลา และปริมาณที่ใกล้เคียงกันในแต่ละมื้อ โดยเฉพาะปริมาณคาร์โบไฮเดรตโดยรวม หากต้องการลดน้ำหนักให้ลดปริมาณอาหาร แต่ไม่ควรงดอาหารมื้อใดมื้อหนึ่ง เพราะจะทำให้หิวและอาจรับประทานในมื้อถัดไปมากขึ้น ซึ่งจะส่งผลให้ระดับน้ำตาลในเลือดขึ้นๆ ลงๆ ควรปรึกษาแพทย์ที่ทำการรักษาเนื่องจากอาจมีการปรับยาในการรักษาเบาหวาน"
    },
    {
        title: "ข้อแนะนำในการรับประทานอาหารสำหรับผู้ป่วยเบาหวาน",
        imgUrl : "https://siph-space.sgp1.digitaloceanspaces.com/media/upload/bread-2864703_640.jpg",
        content: "รับประทานข้าว ก๋วยเตี๋ยว ขนมปังได้ตามปกติ ไม่ต้องลดลงมาก เว้นแต่เฉพาะผู้ป่วยที่มีภาวะอ้วนให้ลดปริมาณลงครึ่งหนึ่ง\nรับประทานผลไม้ที่หวานน้อย และมีใยอาหารมาก ตามปริมาณที่กำหนด วันละ 2-3 ครั้งแทนขนม\nรับประทานผักให้มากขึ้นทุกมื้อ\nรับประทานผัก ผลไม้ทั้งกาก แทนการคั้นดื่มแต่น้ำ\nรับประทานไข่ได้ แต่หากผู้ป่วยมีไขมันโคเลสเตอรอลในเลือดสูง ให้งดไข่แดง\nรับประทานเนื้อสัตว์ไม่ติดมัน และไม่ติดหนัง\nรับประทานปลาและเต้าหู้ให้บ่อยขึ้น\nเลือกรับประทานอาหารที่มีไขมันน้อย และใช้น้ำมันน้อย เช่น อาหารประเภทต้ม นึ่ง ย่าง ผัด แทนอาหารประเภททอด\nใช้น้ำมันพืชจำพวกน้ำมันถั่วเหลือง หรือน้ำมันรำข้าวในการทอด ผัด อาหารแต่พอควร\nหลีกเลี่ยงอาหารใส่กะทิ ไขมันสัตว์ และอาหารทอดเป็นประจำ รวมทั้งขนมอบ เช่น พัฟ พาย เค้ก\nเลือกดื่มนมขาดมันเนย (ไขมัน 0%) นมจืดพร่องมันเนย แทนนมปรุงแต่งรส\nหลีกเลี่ยงน้ำหวาน น้ำอัดลม ลูกอม ช็อกโกแลต และขนมหวานจัดต่างๆ\nใช้น้ำตาลเทียมใส่เครื่องดื่มและอาหารแทนการใช้น้ำตาลทราย\nรับประทานอาหารรสอ่อนเค็ม รสไม่จัด\nอ่านฉลากข้อมูลโภชนาการที่อยู่บนบรรจุภัณฑ์ก่อนรับประทาน โดยเลือกอาหารที่มีปริมาณน้ำตาลน้อยกว่า 20 กรัม"
    },
    {
        title: "Head 3",
        imgUrl : "https://siph-space.sgp1.digitaloceanspaces.com/media/upload/bread-2864703_640.jpg",
        content: "detail 3"
    },
    {
        title: "Head 4",
        imgUrl : "https://siph-space.sgp1.digitaloceanspaces.com/media/upload/bread-2864703_640.jpg",
        content: "detail 4"
    },
    {
        title: "Head 5",
        imgUrl : "https://siph-space.sgp1.digitaloceanspaces.com/media/upload/bread-2864703_640.jpg",
        content: "detail 5"
    },
]

const headerData = [
    {
        title: "ความหมาย",
        content: "โรคที่ร่างกายมีระดับน้ำตาลในเลือดสูงผิดปกติ โดยเกิดจากความผิดปกติของการใช้น้ำตาล ทำให้ร่างกายไม่สามารถนำน้ำตาลไปใช้เป็นพลังงานได้ตามปกติ ทำให้มีระดับน้ำตาลสูงขึ้น"
    },
    {
        title: "สาเหตุ",
        content: [
            "เบาหวานประเภทที่ 1 (Type 1 Diabetes) เกิดจากตับอ่อนไม่สามารถผลิตฮอร์โมนอินซูลินได้",
            "เบาหวานประเภทที่ 2 (Type 2 Diabetes) เกิดจากการที่ตับอ่อนผลิตฮอร์โมนอินซูลินได้ไม่เพียงพอต่อการใช้ หรือเกิดภาวะการดื้ออินซูลิน (Insulin Resistance)",
            "เบาหวานขณะตั้งครรภ์ (Gestational Diabetes) ซึ่งเป็นโรคเบาหวานที่พัฒนาขึ้นระหว่างการตั้งครรภ์จากการเปลี่ยนแปลงฮอร์โมน โดยที่ผู้ป่วยไม่เคยเป็นโรคเบาหวานมาก่อน ",
            "กรรมพันธุ์หรือแบบโมโนเจนิก (Monogenic Diabetes)",
            "การใช้ยา ",
            "โรคชนิดอื่นอย่างโรคซิสติก ไฟโบรซิส (Cystic Fibrosis)",
        ]
    },
    {
        title: "ลดความเสี่ยงต่อการเกิดโรค",
        content: [
            "กรรมพันธุ์ แม้จะเป็นปัจจัยที่ยากต่อการหลีกเลี่ยง แต่การหมั่นตรวจสุขภาพร่างกาย หรือตรวจเลือดอยู่เป็นระยะ ก็เป็นการช่วยลดความเสี่ยงลงได้",
            "น้ำหนักตัว พบว่าส่วนใหญ่แล้วผู้ที่มีน้ำหนักมาก มักจะสุ่มเสี่ยงต่อการเกิดโรคชนิดต่างๆ นอกจากเบาหวานได้ค่อนข้างเยอะ เพราะเมื่อน้ำหนักตัวเพิ่มมาก ระดับน้ำตาลในเลือดจะเพิ่มมากขึ้นตามไปด้วย หากร่างกายไม่มีการดึงเอาน้ำตาลจากเลือดออกมาใช้ ก็ทำให้เกิดภาวะระดับน้ำตาลสูง เสี่ยงต่อการเกิดภาวะแทรกซ้อนต่างๆ ตามมาได้",
            "น้ำหนักลงโดยไม่ตั้งใจ เกิดจากร่างกายไม่สามารถดึงเอาน้ำตาลออกมาใช้เป็นพลังงานได้ ทำให้ต้องดึงไขมันที่เก็บสะสมไว้ในกล้ามเนื้อมาใช้แทน ผู้ป่วยจึงมีรูปร่างผอมแห้ง และน้ำหนักลดลง",
            "พฤติกรรมการรับประทานอาหาร ต้องยอมรับว่าในปัจจุบันอาหาร ผัก ผลไม้ ขนม หรือของทานเล่น ส่วนใหญ่กลายเป็นปัจจัยสำคัญต่อการกระตุ้นโรคเบาหวานได้มากขึ้น โดยเฉพาะผู้ที่ชอบรับประทานอาหารรสชาติหวาน หรืออาหารที่มีคาร์โบไฮเดรตสูง เช่น แป้ง น้ำตาล เหล่านี้คือการสะสมปริมาณสารอาหารที่ไม่จำเป็นไว้ในร่างกายอย่างหลีกเลี่ยงไมได้ ในกรณีคนรสนิยมรับประทานหวานแต่ไม่พบประวัติคนในครอบครัวเคยเป็นเบาหวานมาก่อน ก็อาจไม่ส่งผลให้เป็นเบาหวาน เพราะการรับประทานหวานได้ หากแต่จะเป็นการสะสมระดับน้ำตาลในเลือดและน้ำหนักตัวขึ้นมาแทน ซึ่งเป็นหนึ่งในปัจจัยเสี่ยงดังที่ได้กล่าวไว้ในข้างต้น",
            "เครื่องดื่มแอลกอฮอล์ และบุหรี่ นอกจากรสชาติอาหารที่มีความหวานแล้ว การดื่มสุรา แอลกอฮอล์ และสูบบุหรี่ ก็ยังเป็นปัจจัยย่อยที่มีส่วนในการสร้างโรคเบาหวานได้เช่นกัน",
            "อายุขัย และสตรีที่มีประวัติเคยเป็นเบาหวานขณะตั้งครรภ์ ก็เป็นอีกหนึ่งปัจจัยเสี่ยงที่ง่ายต่อการเกิดเบาหวานได้อีกด้วย",
            
        ]
    },
    {
        title: "สัญญาณการเกิดโรค",
        content: [
            "หิวน้ำบ่อย",
            "ปัสสาวะบ่อยและปริมาณมาก",
            "น้ำหนักตัวลดลงโดยไม่มีสาเหต",
            "ถ้าตรวจระดับน้ำตาลเวลาใดก็ได้ไม่จำเป็นต้องอดอาหาร >= 200มก./ดล.",
            "ระดับน้ำตาลในเลือดหลังอดอาหาร (อย่างน้อย 8 ชั่วโมง) >= 126มก./ดล.",
            "ตรวจความทนต่อกลูโคส รับประทานกลูโคส 75 g แล้วตรวจเลือดที่ 2 ชั่วโมง >= 20มก./ดล.",
            "ตรวจระดับน้ำตาลสะสม (A1C >= 6.5%) ต้องทำในห้องแลป",
        ]
    },
    {
        title: "คำแนะนำในการปฎิบัติตัว",
        content: [
            "ควรดื่มน้ำสะอาดมากกว่า 8 แก้วต่อวัน",
            "ควบคุมระดับน้ำตาลในเลือด ความดันโลหิต ไขมันในเลือดและน้ำหนักตัวให้ได้ตามเป้าหมาย เพื่อป้องกันภาวะแทรกซ้อนของโรคเบาหวาน",
            "รับประทานอาหารให้ตรงเวลา ครบทั้ง 3 มื้อ แม้จะไม่หิวก็ตาม ลดหรือหลีกเลี่ยงการรับประทานของว่างที่ไม่จำเป็น",
            "รับประทานข้าว/แป้งไม่ขัดสีในปริมาณที่หมาะสม (1-3 ทัพพีต่อมื้อ)",
            "รับประทานผลไม้สดเป็นประจำ 2-3 มื้อต่อวัน ปริมาณ 6-8 ชิ้นคำต่อมื้อ หากเลือกผลไม้ขนาดกลาง ½ ผลต่อมื้อ หรือขนาดค่อนข้างเล็ก 1-2 ผลต่อมื้อ",
            "รับประทานเนื้อสัตว์ไม่ติดหนังและไม่ติดมันในปริมาณที่เหมาะสม",
            "เน้นผักใบให้มาก",
            "ใช้น้ำมันพืชในการประกอบอาหารได้ เช่น น้ำมันรำข้าว น้ำมันถั่วเหลือง น้ำมันดอกทานตะวัน เป็นต้น ควรหลีกเลี่ยงน้ำมันจากสัตว์ น้ำมันปาล์มและน้ำมันมะพร้าว",
            "แนะนำให้ดื่มนมรสจืดพร่องมันเนย หรือขาดมันเนยประมาณ 250 มิลลิลิตรต่อวัน หรือโยเกิร์ตรสธรรมชาติไม่เกิน 1 ถ้วยต่อวัน",
            "อ่านฉลากโภชนาการก่อนเลือกซื้ออาหารทุกครั้ง",
            "ออกกำลังกาย วันละ 30 นาที ย่างน้อย 150 นาทีต่อสัปดาห์",
            "รับประทานยา หรือฉีดยาตามคำสั่งแพทย์",
            "สำรวจเท้า  และทาโลชั่นทุกวันทันทีหลังจากทำความสะอาด หากพบความผิดปกติควรรีบปรึกษาแพทย์",
            "ควรตรวจฟันและช่องปากทุก 6 เดือน",
            "ลด การรับประทานอาหารหวาน เครื่องดื่มที่มีรสหวาน หรือให้ใช้น้ำตาลเทียม หรือสารให้ความหวานเทียมแทนน้ำตาล",
            "ลด การรับประทานอาหารมัน เช่น อาหารจานเดียว อาหารทอดและอาหารที่มีกะทิเป็นส่วนประกอบ รวมถึงเนื้อสัตว์แปรรูป เช่น ไส้กรอก เบคอน หมูยอ กุนเชียง เป็นต้น",
            "ลด การรับประทานอาหารเค็ม เช่น ขนมมกรุบกรอบ อาหารกึ่งสำเร็จรูป อาหารหมักดอง อาหารแปรรูป อาหารกระป๋อง และเครื่องปรุงรส เป็นต้น รวมถึงการลดการรับประทานน้ำซุปต่างๆ หรือใช้หลักการตักเนื้อทิ้งน้ำ และลดการรับประทานน้ำจิ้ม",
            "งด สูบบุหรี่และเครื่องดื่มแอลกอฮอล์",    
        ]
    },

]

const blogTrends = [
    {
        id: 0,
        type: "blogs",
        categories: "blogs_food",
        title_th: "เมนูไทยๆ_ต้านโรคภัย_เพิ่มภูมิคุ้มกัน",
        title: "เมนูไทยๆ ต้านโรคภัย เพิ่มภูมิคุ้มกัน",
        intro :"7 เมนูไทยๆ ต้านโรคภัย เพิ่มภูมิคุ้มกัน วัตถุดิบและกรรมวิธีการทำอาหารของไทยนั้นเป็นยาดีเพิ่มภูมิคุ้มกันให้ร่างกายของเราได้ด้วยตัวของมันอยู่แล้ว",
        detail: "ต้มยำกุ้ง – กับข้าวรสร้อนแรงไม่ว่าใส่กะทิหรือไม่ใส่ก็อร่อยทั้งแบบ ยิ่งถ้าเป็นหวัดคัดจมูกได้ทานต้มยำกุ้งเข้าไปต้องรู้สึกล่งคอโล่งจมูกกันทั้งนั้น เพราะส่วนประกอบในต้มยำกุ้งนั้น เช่น ใบมะกรูด ขิง หอมแดงที่มีสารสารเคอร์ซีติน รวมถึงเห็ดต่างๆ ที่มีสารเบต้ากลูแคนเพิ่มภูมิคุ้มกันลดความเสี่ยงที่เชื้อไวรัสจะเข้าสู่เซลล์ในร่างกาย",
        ref: "https://www.paolohospital.com/th-TH/rangsit/Article/Details/บทความโภชนาการ-/7-เมนูไทยๆ-ต้านโรคภัย-เพิ่มภูมิคุ้มกัน",
        imgUrl: "https://www.paolohospital.com/Resource/Image/Article/shutterstock_289936964.jpg",
    },

] 
const ncds = [
    {
        ncds: "โรคเบาหวาน",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        imgUrl: "https://www.poonrada.com/upload/sickness/2019/07/2127fc6c17b6571965a73fd94dd623ca.jpg",
        videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: true,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },
    {
        ncds: "ความดันโลหิตสูง",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        // videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: false,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },
    {
        ncds: "โรคถุงลมโป่งพอง",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: true,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },
    {
        ncds: "โรคหลอดเลือดสมอง",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        // videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: false,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },
    {
        ncds: "โรคอ้วนลงพุง",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: true,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },
    {
        ncds: "โรคมะเร็ง",
        because: "สามารถทานได้ในปริมาณที่จำกัด และควรทานข้าวปริมาณจำกัดเพื่อเลี่ยงน้ำตาล หากต้มยำกุ้งใส่กะทิไม่ควรทานและไม่ควรทานเค็ม",
        // videoUrl: "https://youtu.be/FdOOBcN0Ws8",
        suggess: false,
        ref: "https://www.poonrada.com/sickness/detail/87",
    },

]